20211205212024-my_daily_routine.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-29 Fri 15:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My daily routine</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">My daily routine</h1>
<p>
I know <i>within the first two hours</i> of my day if it is going to be productive or not. Everything is geared towards making the creative work happen then. I used to wake up at 5am and write a few thousand words before getting breakfast, but it is unfortunately now impossible without waking up my two youg children. I don't have time to myself until around 8:30 am.
</p>

<p>
I have found that preserving creativity and clarity of mind is more about how you experience your environment and what you choose to pay attention to. Making breakfast, having coffee, chatting with the kids and even pushing them through the door is part of a flow, and if I make an effort to be conciously present it feeds my creativity more than it depletes it. Being exposed to other people's ideas and opinions, however, is a creativity sink. My mind is suddenly filled with other people's voice and I cannot hear mine anymore. That's why I go for a full internet ban until 10am. The US is asleep, most French people are not at work yet. I am not needded, but I need this time for myself.
</p>

<p>
I have a few guitars, and one sits right next to my desk. When I need a break during the day I instictively grab it and work on my scale, play a few tunes I know, work through a new one. 15-30 minutes is all I need to completely empty my head, start afresh, and I even become a better player over time! Don't tell VCs, I usually work on my scales when I call them :)
</p>

<p>
I also try to allow myself some "free thinking" time every day, where I will typically go for a walk and let my mind wander. That's usually where my best ideas come from.
</p>

<p>
The evening is trickier since the US is still awake when I go to bed. But I need to set boundaries, for myself and my family. So I will drop my phone in the office when I come in, check it again after the kids are asleep, and then charge it in the office. I recently bought an old-school alarm clock so I don't need the phone to be next to my bed.
</p>

<div id="outline-container-org0b5c205" class="outline-2">
<h2 id="org0b5c205">Links to this note</h2>
<div class="outline-text-2" id="text-org0b5c205">
<ul class="org-ul">
<li><a href="./now.html">🌿 Now</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
